tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
#ifndef NATIVE_BUILD

#include "web/FaucetWeb.h"

#include "app/AppController.h"
#include "app/AppConfig.h"
#include "app/ConfigStore.h"
#include "app/FilterStore.h"
#include "app/WaterLogFileStore.h"
#include "web/FaucetWebJson.h"
#include "web/FaucetWebRoutes.h"

#include <Esp32Base.h>
#include <cstdarg>
#include <cstdio>
#include <cstdlib>
#include <cstring>

namespace faucet {
namespace {

constexpr std::uint32_t kMinFilterDateSeconds = 631152000UL;  // 2020-01-01 in seconds since 2000-01-01.
FaucetWebContext g_context{};

bool requireContext();
bool getParam(const char* name, char* out, std::size_t len);
bool parseU32(const char* text, std::uint32_t& value);
bool parseDate(const char* text, std::uint32_t& seconds);
void formatDate(std::uint32_t seconds, char* out, std::size_t len);

Esp32BaseWeb::Method toBaseMethod(FaucetWebMethod method) {
    switch (method) {
        case FaucetWebMethod::Get:
            return Esp32BaseWeb::METHOD_GET;
        case FaucetWebMethod::Post:
            return Esp32BaseWeb::METHOD_POST;
        case FaucetWebMethod::Any:
        default:
            return Esp32BaseWeb::METHOD_ANY;
    }
}

void sendFmt(const char* fmt, ...) {
    char buffer[256]{};
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    Esp32BaseWeb::sendChunk(buffer);
}

void formatLiters(std::uint32_t ml, char* out, std::size_t len) {
    const std::uint32_t centiliters = (ml + 5UL) / 10UL;
    std::snprintf(out, len, "%lu.%02lu L", static_cast<unsigned long>(centiliters / 100UL),
                  static_cast<unsigned long>(centiliters % 100UL));
}

void formatLiterValue(std::uint32_t ml, char* out, std::size_t len) {
    if (ml == 0) {
        std::snprintf(out, len, "0");
        return;
    }
    const std::uint32_t centiliters = (ml + 5UL) / 10UL;
    std::snprintf(out, len, "%lu.%02lu", static_cast<unsigned long>(centiliters / 100UL),
                  static_cast<unsigned long>(centiliters % 100UL));
}

std::uint32_t filterProgressPercent(const FilterRecord& filter, std::uint32_t usedDays) {
    if (filter.recommendDays == 0) {
        return 0;
    }
    const std::uint64_t percent = (static_cast<std::uint64_t>(usedDays) * 100ULL) / filter.recommendDays;
    return percent > 100ULL ? 100UL : static_cast<std::uint32_t>(percent);
}

std::uint32_t daysToMonths(std::uint32_t days) {
    return (days + kDaysPerLifeMonth - 1UL) / kDaysPerLifeMonth;
}

std::uint32_t monthsToDays(std::uint32_t months) {
    const std::uint32_t maxMonths = kMaxFilterLifeDays / kDaysPerLifeMonth;
    if (months > maxMonths) {
        months = maxMonths;
    }
    return months * kDaysPerLifeMonth;
}

void formatLifeRange(const FilterRecord& filter, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (filter.recommendDays == 0) {
        std::snprintf(out, len, "未设置天数");
        return;
    }
    const std::uint32_t minMonths = daysToMonths(filter.recommendDays);
    const std::uint32_t maxMonths = daysToMonths(filter.maxDays);
    if (maxMonths > minMonths) {
        std::snprintf(out, len, "%lu～%lu个月", static_cast<unsigned long>(minMonths),
                      static_cast<unsigned long>(maxMonths));
    } else {
        std::snprintf(out, len, "%lu个月", static_cast<unsigned long>(minMonths));
    }
}

const char* filterStatusText(FilterLifeStatus status) {
    switch (status) {
        case FilterLifeStatus::RecommendReplace:
            return "建议更换";
        case FilterLifeStatus::Expired:
            return "已超期";
        case FilterLifeStatus::Normal:
        default:
            return "正常";
    }
}

const char* filterDisplayStatusText(const FilterRecord& filter, std::uint32_t usedDays) {
    if (!filter.enabled) {
        return "停用";
    }
    return filterStatusText(filterLifeStatus(filter, usedDays));
}

void sendLiters(std::uint32_t ml) {
    char text[24]{};
    formatLiters(ml, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void sendMetricCard(const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<section class='metric-card'><span>");
    Esp32BaseWeb::sendChunk(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::sendChunk(value);
    Esp32BaseWeb::sendChunk("</strong></section>");
}

void sendAppStyles() {
    Esp32BaseWeb::sendChunk("<style>"
                            "body{background:#f5f7f8;color:#1f2933;max-width:1120px;padding:12px 14px}"
                            "h1{color:#111827}"
                            "h2{font-size:1.22rem;margin:0 0 10px;color:#111827}"
                            "h3{font-size:1rem;margin:0;color:#111827}"
                            "a,button,input[type=submit],input[type=button]{border-radius:6px;box-shadow:none}"
                            ".faucet-actions{display:flex;flex-wrap:wrap;gap:6px;margin:0 0 10px}"
                            ".faucet-actions a{display:inline-flex;align-items:center;min-height:32px;line-height:1.2;margin:0;white-space:nowrap}"
                            "input:not([type]),input[type=text],input[type=password],input[type=number],input[type=email],input[type=url],input[type=tel],input[type=search],select{width:100%;height:34px;padding:6px 9px;margin:0;border:1px solid #d1d5db;border-radius:6px;box-sizing:border-box;background:#fff;font-size:.96rem}"
                            "select{margin:3px 0 8px}"
                            ".panel{border:1px solid #e1e5ea;border-radius:8px;padding:10px 12px;margin:0 0 10px;background:#fff}"
                            ".panel h3{padding-bottom:7px;margin-bottom:9px;border-bottom:1px solid #edf0f3}"
                            ".grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(190px,1fr));gap:9px 12px}"
                            ".field{display:block;margin:0}"
                            ".field span{display:block;font-size:.84em;color:#3f4b5a;margin-bottom:4px}"
                            ".field input{margin:0}"
                            ".hint{display:block;color:#687386;font-size:.78em;margin:3px 0 0}"
                            ".status-pill{display:inline-block;padding:2px 7px;border-radius:999px;background:#eef2f7;color:#1f2933;font-size:.78rem;line-height:1.2;white-space:nowrap}"
                            ".muted{color:#687386}"
                            ".metric-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(150px,1fr));gap:8px;margin:0 0 12px}"
                            ".metric-card{background:#fff;border:1px solid #e1e5ea;border-radius:8px;padding:10px 12px}"
                            ".metric-card span{display:block;color:#687386;font-size:.78rem;margin-bottom:5px}"
                            ".metric-card strong{display:block;color:#111827;font-size:1.1rem;line-height:1.2}"
                            ".filter-cards{display:grid;grid-template-columns:repeat(auto-fit,minmax(230px,1fr));gap:10px;margin:0 0 12px}"
                            ".filter-card{background:#fff;border:1px solid #e1e5ea;border-radius:8px;padding:11px 12px}"
                            ".filter-head{display:flex;align-items:center;justify-content:space-between;gap:8px;margin-bottom:8px}"
                            ".filter-head strong{color:#111827}"
                            ".filter-meta{display:grid;grid-template-columns:1fr 1fr;gap:5px 10px;color:#4b5563;font-size:.84rem;margin-top:8px}"
                            ".progress{height:8px;background:#eef2f7;border-radius:999px;overflow:hidden}"
                            ".progress span{display:block;height:100%;background:#2678c8;border-radius:999px}"
                            ".check-field{display:block;margin:0}"
                            ".check-title{display:block;font-size:.84em;color:#3f4b5a;margin-bottom:4px}"
                            ".check-line{display:flex;align-items:center;gap:7px;height:34px;padding:0 10px;border:1px solid #d1d5db;border-radius:6px;background:#fff;box-sizing:border-box;color:#1f2933;font-size:.95rem;white-space:nowrap}"
                            ".check-line input[type=checkbox]{margin:0;flex:0 0 auto}"
                            ".form-actions{display:flex;align-items:center;justify-content:flex-start;gap:8px;margin-top:4px}"
                            "form input[type=submit]{min-height:34px;padding:7px 18px;margin:0}"
                            "table{width:100%;border-collapse:collapse;margin:0 0 12px;background:#fff;border:1px solid #e1e5ea;border-radius:8px;overflow:hidden}"
                            "td,th{padding:7px 9px;border-bottom:1px solid #edf0f3;text-align:left}"
                            "tr:last-child td{border-bottom:0}"
                            "@media(max-width:520px){body{padding:10px}.grid,.metric-grid,.filter-cards{grid-template-columns:1fr}.panel{padding:10px}}"
                            "</style>");
}

bool sendPageStart(const char* title) {
    if (!Esp32BaseWeb::checkAuth()) {
        return false;
    }
    Esp32BaseWeb::sendHeader(title);
    sendAppStyles();
    return true;
}

void sendPageEnd() {
    Esp32BaseWeb::sendFooter();
}

const char* stateText(WaterState state) {
    switch (state) {
        case WaterState::Idle:
            return "待机";
        case WaterState::Confirm:
            return "确认";
        case WaterState::Running:
            return "出水中";
        case WaterState::Paused:
            return "暂停";
        case WaterState::Error:
            return "异常";
    }
    return "未知";
}

const char* modeText(WaterMode mode) {
    switch (mode) {
        case WaterMode::Volume:
            return "容量";
        case WaterMode::Time:
            return "时间";
        case WaterMode::Calibration:
            return "校准";
    }
    return "未知";
}

const char* resultText(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return "完成";
        case WaterResult::StoppedByUser:
            return "手动停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendTextInput(const char* label, const char* name, unsigned long value) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'></label>", label, name, value);
}

void sendVolumeInput(const char* label, const char* name, std::uint32_t value) {
    char liters[24]{};
    formatLiters(value, liters, sizeof(liters));
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>当前 %s</small></label>",
            label,
            name,
            static_cast<unsigned long>(value),
            liters);
}

void sendMonthInput(const char* label, const char* name, std::uint32_t days) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>按 30 天/月计算</small></label>",
            label,
            name,
            static_cast<unsigned long>(daysToMonths(days)));
}

